# SketchId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..SketchId Property
FabricArea Class See Also
---
The id of the Sketch element for this element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId SketchId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SketchId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ SketchId {
	ElementId^ get ();
}
```

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace